[
  {
    "Title": "How to apply Minoxidil",
    "Synopsis": "Using Minoxidil to help grow a thicker beard requires discipline and patience. Don’t expect to see results immediately, and don’t become discouraged when it seems that nothing is happening. That said, here’s the how-to of applying liquid Minoxidil",
    "Thumbnail": "https://devcrux.com/wp-content/uploads/108377.jpg",
    "Url": "https://tallstack.github.io/How%20to%20Apply%20Liquid%20Minoxidil-%20My%20Routine.mp4",
    "IsFeatured": true
  },
  {
    "Title": "Dermarolling 101",
    "Synopsis": "Many men are curious whether this kind of micro-needling device can be used to grow a beard faster naturally. The answer is, theoretically yes. A derma roller can be safely used for the facial hair area and it should result in thicker growth of beard through stimulation of blood circulation.",
    "Thumbnail": "https://devcrux.com/wp-content/uploads/139941.jpg",
    "Url": "https://tallstack.github.io/Dermarolling%20101-%20My%20Routine.mp4",
    "IsFeatured": false
  },
  {
    "Title": "10 Tips for Minoxidil Journey",
    "Synopsis": "Here’s Everything You Need to Know About Using Minoxidil for Hair Growth, These 10 tips should help make your Minoxidil journey much smoother",
    "Thumbnail": "https://devcrux.com/wp-content/uploads/119390.jpg",
    "Url": "https://tallstack.github.io/10%20Quick%20Tips%20On%20Starting%20Your%20Minox%20Beard%20Journey.mp4",
    "IsFeatured": false
  },
  {
    "Title": "Men who grew a beard with Minox",
    "Synopsis": "this video shows 24 men who've grown beards using Minoxidil. This video also helps show that the results vary from person to person. Some may see amazing results in a very short period of time while it may take longer for others. NOTE: None of the men in this video are finished with their Minoxidil journey (At the time), this video is meant to show their current progress and to show how much of an improvement they made in a short period of time. Their beards are expected to get much fuller as they continue to use Minoxidil. The average time for treatment is 1-2 years. These are men who generally have seen no natural progress in years.",
    "Thumbnail": "https://devcrux.com/wp-content/uploads/78216.jpg",
    "Url": "https://tallstack.github.io/33%20Men%20Who%20Grew%20Beards%20Using%20Minoxidil%20-%20The%20Minox%20Beard%20Spot%20-%20Minoxidil%20Beard%20Showcase.mp4",
    "IsFeatured": false
  }
]