[
    {
        "Title": "How to apply Minoxidil",
        "Synopsis": "Using Minoxidil to help grow a thicker beard requires discipline and patience. Don’t expect to see results immediately, and don’t become discouraged when it seems that nothing is happening. That said, here’s the how-to of applying liquid Minoxidil",
        "Thumbnail": "https://devcrux.com/wp-content/uploads/108377.jpg",
        "Url": "https://movietrailers.apple.com/movies/independent/a-good-woman-is-hard-to-find/a-good-woman-is-hard-to-find-trailer-1_h480p.mov",
        "IsFeatured": true
    },
    {
        "Title": "Dermarolling 101",
        "Synopsis": "Mickey Rourke and Bai Ling star in this epic tale of courage and heroism in a time of war. During the invasion of Parthia, two Roman legions have been brought to a standstill in the snowy mountains of Armenia, leaving them slowly dying in the freezing cold. The rest of the Roman army is a two weeks’ march away, and the region swarms with Parthian patrols. Their only hope for survival is Noreno, a half-Roman soldier, who is entrusted with the impossible mission of crossing the deadly terrain to seek help for his men and turn the tide of the battle.",
        "Thumbnail": "https://devcrux.com/wp-content/uploads/139941.jpg",
        "Url": "https://movietrailers.apple.com/movies/paramount_classics/the-legion/the-legion-trailer-1_h480p.mov",
        "IsFeatured": false
    },
    {
        "Title": "Walkaway Joe",
        "Synopsis": "WALKAWAY JOE is the story of an unlikely friendship between a young boy searching for his father in pool halls across the country, and a wandering loner hiding from his past. In each other they experience the power of a second chance, and a shot at redemption.",
        "Thumbnail": "https://devcrux.com/wp-content/uploads/119390.jpg",
        "Url": "https://movietrailers.apple.com/movies/independent/walkaway-joe/walkaway-joe-trailer-1_h480p.mov",
        "IsFeatured": false
    },
    {
        "Title": "Hope Gap",
        "Synopsis": "The intimate, intense and loving story of HOPE GAP charts the life of Grace (Annette Bening), shocked to learn her husband (Bill Nighy) is leaving her for another after 29 years of marriage, and the ensuing emotional fallout the dissolution has on their only grown son (Josh O’Connor). Unraveled and feeling displaced in her small seaside town, Grace ultimately regains her footing and discovers a new, powerful voice.",
        "Thumbnail": "https://devcrux.com/wp-content/uploads/78216.jpg",
        "Url": "https://movietrailers.apple.com/movies/roadsideattractions/hope-gap/hope-gap-trailer-1_h480p.mov",
        "IsFeatured": false
    }
]